Revit 2027 API
FabricationPart.HasLining Property
 True if the fabrication part is lined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasLining { get; }
Public ReadOnly Property HasLining As Boolean
	Get
public:
property bool HasLining {
	bool get ();
}
member HasLining : bool with get
Property Value
Boolean
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace